Repository: flyingrtx2333/AssetTimeMachine
Catalog: AssetTimeMachine/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# 可同时勾选多种资产；初始资金会按资产数量平均分配，每种资产独立执行同一套买卖规则。
source: Multiple assets can be selected at the same time; the initial funds will be evenly distributed according to the number of assets, and each asset will independently execute the same set of buying and selling rules.
zh_hans: 可同时勾选多种资产；初始资金会按资产数量平均分配，每种资产独立执行同一套买卖规则。
zh_hant: 可同時勾選多種資產；初始資金會以資產數量平均分配，且每種資產獨立執行同一套買賣規則。

# 回撤再入场动量
source: Drawdown momentum
zh_hans: 回撤再入场动量
zh_hant: 回檔再入場動量

# 回撤再入场动量建仓
source: Drawdown Re-Entry Momentum Entry
zh_hans: 回撤再入场动量建仓
zh_hant: 回撤再入場動量建倉

# 回撤收益比
source: Return / Drawdown
zh_hans: 回撤收益比
zh_hant: 回撤收益比

# 回测中未投入资产的现金仓按历史活期存款基准利率日化计息；实际银行、货币基金或现金管理产品收益可能不同。
source: Uninvested cash in backtests accrues daily interest at the historical RMB demand-deposit benchmark rate. Actual returns on bank deposits, money market funds, or cash-management products may differ.
zh_hans: 回测中未投入资产的现金仓按历史活期存款基准利率日化计息；实际银行、货币基金或现金管理产品收益可能不同。
zh_hant: 回測中未投入資產的現金倉以歷史活期存款基準利率日化計息；實際銀行、貨幣基金或現金管理產品收益可能不同。

# 回测区间
source: Backtest Period
zh_hans: 回测区间
zh_hant: 回測區間

# 固定参数
source: Fixed parameters
zh_hans: 固定参数
zh_hant: 固定參數

# 图表右移
source: Chart shifted right
zh_hans: 图表右移
zh_hant: 圖表右移

# 图表左移
source: Chart shifted left
zh_hans: 图表左移
zh_hant: 圖表左移

# 在全球修复传染控制基础上，空闲预算不只留人民币现金；当美元现金趋势优于现金门槛时，使用美元现金承接闲置仓位，全程不融资。
source: On the basis of global recovery and infection control, the idle budget does not only leave RMB cash; when the trend of US dollar cash is better than the cash threshold, US dollar cash is used to take over idle positions without financing throughout the process.
zh_hans: 在全球修复传染控制基础上，空闲预算不只留人民币现金；当美元现金趋势优于现金门槛时，使用美元现金承接闲置仓位，全程不融资。
zh_hant: 在全球修復傳染控制基礎上，空閒預算不只留人民幣現金；當美元現金趨勢優於現金門檻時，使用美元現金承接閒置倉位，全程不融資。

# 在稳健回撤阶梯趋势上叠加九月风险闸门：9月仅保留25%权益仓，砍掉的权益优先转向趋势有效的黄金；目标是降低近期独立区间最大回撤。
source: The September risk gate is superimposed on the steady drawdown ladder trend: only 25% of the equity positions will be retained in September, and the interests that are cut will be given priority to gold with an effective trend; the goal is to reduce the maximum drawdown of the recent independent range.
zh_hans: 在稳健回撤阶梯趋势上叠加九月风险闸门：9月仅保留25%权益仓，砍掉的权益优先转向趋势有效的黄金；目标是降低近期独立区间最大回撤。
zh_hant: 在穩健回撤階梯趨勢上疊加九月風險閘門：9月僅保留25%權益倉，砍掉的權益優先轉向趨勢有效的黃金；目標是降低近期獨立區間最大回撤。

# 在美元现金修复策略上加入黄金恐慌溢价锁：黄金短期暴冲后转弱时临时降低黄金仓，释放预算交给现金选择器，降低2003式黄金回吐。
source: Add gold panic premium lock to the US dollar cash repair strategy: temporarily reduce gold positions when gold weakens after a short-term surge, release the budget to the cash selector, and reduce 2003-style gold withdrawal.
zh_hans: 在美元现金修复策略上加入黄金恐慌溢价锁：黄金短期暴冲后转弱时临时降低黄金仓，释放预算交给现金选择器，降低2003式黄金回吐。
zh_hant: 在美元現金修復策略上加入黃金恐慌溢價鎖：黃金短期暴衝後轉弱時臨時降低黃金倉，釋放預算交給現金選擇器，降低2003式黃金回吐。

# 均衡型
source: Balanced type
zh_hans: 均衡型
zh_hant: 均衡型

# 均衡轮动
source: Balanced rotation
zh_hans: 均衡轮动
zh_hant: 均衡輪動

# 均衡轮动建仓
source: Balanced Rotation Entry
zh_hans: 均衡轮动建仓
zh_hant: 均衡輪動建倉

# 基础
source: Basic
zh_hans: 基础
zh_hant: 基礎

# 基础回测
source: Basic Backtest
zh_hans: 基础回测
zh_hant: 基礎回測

# 基础策略
source: Basic Strategies
zh_hans: 基础策略
zh_hant: 基礎策略

# 增强候选：沿用热度上限元框架，单权益超出上限的风险预算不直接闲置；优先转给趋势和相对强度有效的黄金，否则转给动量为正、站上MA120且波动较低的确认资产。
source: Enhanced Heat-Cap candidate. Risk budget above the single-equity cap is redirected first to gold when trend and relative-strength signals are positive; otherwise it is allocated to a lower-volatility asset with positive momentum above its 120-day moving average.
zh_hans: 增强候选：沿用热度上限元框架，单权益超出上限的风险预算不直接闲置；优先转给趋势和相对强度有效的黄金，否则转给动量为正、站上MA120且波动较低的确认资产。
zh_hant: 增強候選：沿用熱度上限元框架，單權益超出上限的風險預算不直接閒置；優先轉給趨勢和相對強度有效的黃金，否則轉給動量為正、站上MA120且波動較低的確認資產。

# 增强热度上限元
source: Enhance the upper limit of heat
zh_hans: 增强热度上限元
zh_hant: 增強熱度上限元

# 增强热度上限元建仓
source: Enhanced Heat-Cap Entry
zh_hans: 增强热度上限元建仓
zh_hant: 增強熱度上限元素建倉

# 增强轮动
source: Enhanced rotation
zh_hans: 增强轮动
zh_hant: 增強輪動

# 增强轮动建仓
source: Enhanced Rotation Entry
zh_hans: 增强轮动建仓
zh_hant: 增強輪動建倉

# 夏普
source: Sharpe
zh_hans: 夏普
zh_hant: 夏普

# 外部风险信号
source: External risk signals
zh_hans: 外部风险信号
zh_hant: 外部風險訊號

# 天
source: days
zh_hans: 天
zh_hant: 天

# 定投
source: DCA
zh_hans: 定投
zh_hant: 定投

# 实体低
source: Entity low
zh_hans: 实体低
zh_hant: 實體低

# 实体高
source: Entity height
zh_hans: 实体高
zh_hant: 實體高

# 将删除 %@ 的资产记录，删除后无法恢复。
source: The asset record of %1$@ will be deleted and cannot be restored after deletion.
zh_hans: 将删除 %@ 的资产记录，删除后无法恢复。
zh_hant: 將刪除 %1$@ 的資產記錄，刪除後無法復原。

# 将删除 %d 条回测记录，且无法恢复。
source: %1$d backtest records will be deleted and cannot be recovered.
zh_hans: 将删除 %d 条回测记录，且无法恢复。
zh_hant: 將刪除 %1$d 筆回測記錄，且無法復原。

# 将删除 %d 条记录
source: %1$d records will be deleted
zh_hans: 将删除 %d 条记录
zh_hant: 將刪除 %1$d 筆記錄

# 已从云端恢复最新资产数据
source: Latest asset data restored from cloud
zh_hans: 已从云端恢复最新资产数据
zh_hant: 已從雲端恢復最新資產數據

# 已恢复云端最新数据
source: The latest data in the cloud has been restored
zh_hans: 已恢复云端最新数据
zh_hant: 已恢復雲端最新數據

# 已检测到登录凭证，正在验证云端连接。
source: Login credentials detected, verifying cloud connection.
zh_hans: 已检测到登录凭证，正在验证云端连接。
zh_hant: 已偵測到登入憑證，正在驗證雲端連線。

# 已选 %d 条
source: Selected %1$d items
zh_hans: 已选 %d 条
zh_hant: 已選 %1$d 條

# 平均仓位
source: Average Exposure
zh_hans: 平均仓位
zh_hant: 平均部位

# 平均年化
source: Annualized Return
zh_hans: 平均年化
zh_hant: 平均年化

# 平均现金仓
source: Average Cash Allocation
zh_hans: 平均现金仓
zh_hant: 平均現金倉

# 平稳
source: Smooth
zh_hans: 平稳
zh_hant: 平穩

# 年份
source: Year
zh_hans: 年份
zh_hant: 年份

# 年化约%@ 最大回撤约%@ 夏普约%.2f
source: Annualized return is approximately %1$@, maximum drawdown is approximately %2$@, and the Sharpe ratio is approximately %3$.2f.
zh_hans: 年化约%@ 最大回撤约%@ 夏普约%.2f
zh_hant: 年化約%1$@ 最大回撤約%2$@ 夏普約%3$.2f

# 年均结余
source: Average annual balance
zh_hans: 年均结余
zh_hant: 年均結餘

# 年结余
source: Annual
zh_hans: 年结余
zh_hant: 年結餘

# 弹性
source: Flexibility
zh_hans: 弹性
zh_hant: 彈性

# 强势控波轮动
source: Strong wave control rotation
zh_hans: 强势控波轮动
zh_hant: 強勢控波輪動

# 强势控波轮动建仓
source: Momentum Volatility-Control Rotation Entry
zh_hans: 强势控波轮动建仓
zh_hant: 強勢控波輪動建倉

# 当前 %@
source: Current %1$@
zh_hans: 当前 %@
zh_hant: 目前 %1$@

# 当前 --
source: Current --
zh_hans: 当前 --
zh_hant: 目前 --

# 当前%@ · 压力日%@ · 平均分%.0f
source: Current %1$@ · Stress day %2$@ · Average score %3$.0f
zh_hans: 当前%@ · 压力日%@ · 平均分%.0f
zh_hant: 當前%1$@ · 壓力日%2$@ · 平均分數%3$.0f

source: The current net worth is used as the starting principal; every month, the monthly compound interest growth calculated from the annualized income is first added, and then the current month's balance (monthly salary - monthly expenses after inflation) is added; the passive income is converted into monthly according to the annualized income you fill in: net assets × annualized income ÷ 12; the goal is that the passive income covers the monthly expenses after taking inflation into account.
zh_hans: 当前净资产作为起始本金；每个月先按年化收益换算出的月复利增长，再加入当月结余（月薪 - 通胀后的月开销）；被动收入按你填写的年化收益折算为每月：净资产 × 年化收益 ÷ 12；目标是被动收入覆盖考虑通胀后的月开销。
zh_hant: 當前淨資產作為起始本金；每個月先按年化收益換算出的月複利增長，再加入當月結餘（月薪 - 通脹後的月開銷）；被動收入按你填寫的年化收益折算為每月：淨資產 × 年化收益 ÷ 12；目標是被動收入覆蓋考慮通脹後的月化收益。

# 当前分数
source: Current Score
zh_hans: 当前分数
zh_hant: 當前分數

# 当前回测区间内部分汇率数据不足
source: Insufficient exchange rate data in some parts of the current backtest range
zh_hans: 当前回测区间内部分汇率数据不足
zh_hant: 目前回測區間內部分匯率資料不足

# 当前回测区间内部分资产历史数据不足
source: Insufficient historical data for some assets within the current backtest range
zh_hans: 当前回测区间内部分资产历史数据不足
zh_hant: 目前回測區間內部分資產歷史資料不足

# 当前总资产
source: Current total assets
zh_hans: 当前总资产
zh_hant: 當前總資產

# 当前数据暂时无法完成回测
source: The current data cannot be completed for the time being.
zh_hans: 当前数据暂时无法完成回测
zh_hant: 目前資料暫時無法完成回測

# 当前无法财富自由
source: Not Yet Financially Independent
zh_hans: 当前无法财富自由
zh_hant: 目前無法財富自由

source: Unlevered Sharpe leader. Retains the 15% fast bridge and a recovery sleeve of up to 20.75%, contracting the sleeve to 19% in high volatility and allocating between Nasdaq and the S&P 500 using 95-session momentum, downside volatility, and trend efficiency. The sleeve exits after both indices fall 5% over three sessions and then observes a 150-session cooldown. Leadership transitions use a Beta(2, 2) reliability model. Near a 252-session portfolio high, up to 25% of non-liquidation risk reduction may be buffered based on exposure and turnover impact. Signals use T−1 data, gross exposure is capped at 100%, cash remains non-negative, and results include a 1% trading fee and 0.05% slippage.
zh_hans: 当前无融资夏普冠军：保留15%快速桥接和最高20.75%的恢复袖套；高波动时自动收缩至19%，并按95日动量、下行波动与趋势效率在纳指/标普间分配。恢复袖套在双指数3日同时下跌5%时退出，退出后冷却150日。领导资产切换继续使用Beta(2,2)兑现率校准；非清仓减仓且基础净值距252日高点不足4%时，按总仓位下降与总换手冲击保留最多25%的缓冲，广泛减仓时分散到本次卖出资产。全部信号严格使用T−1数据，总仓位封顶100%，现金不得为负，统一计入1%交易费与0.05%滑点。
zh_hant: 目前無融資夏普冠軍：保留15%快速橋接和最高20.75%的恢復袖套；高波動時自動收縮至19%，並按95日動量、下行波動與趨勢效率在納指/標普間分配。恢復袖套在雙指數3日同時下跌5%時退出，退出後冷卻150日。領導資產切換繼續使用Beta(2,2)兌現率校準；非清倉減倉且基礎淨值距252日高點不足4%時，按總倉位下降與總換手沖擊保留最多25%的緩衝，廣泛減倉時分散到本次賣出資產。全部訊號嚴格使用T−1數據，總部位封頂100%，現金不得為負，統一計入1%交易費與0.05%滑點。

# 当前月开销
source: Current monthly expenses
zh_hans: 当前月开销
zh_hant: 目前月開銷

# 当前没有资产满足策略条件
source: No assets currently meet the strategy criteria
zh_hans: 当前没有资产满足策略条件
zh_hant: 目前沒有資產滿足策略條件

# 当前状态
source: Current Status
zh_hans: 当前状态
zh_hant: 目前狀態

# 当前策略
source: Current Strategy
zh_hans: 当前策略
zh_hant: 目前策略

# 当前筛选下没有匹配记录
source: There are no matching records under the current filter
zh_hans: 当前筛选下没有匹配记录
zh_hant: 目前篩選下沒有匹配記錄

# 当前行情或策略计算尚未完成，暂时无法生成目标仓位。
source: The current market price or strategy calculation has not been completed, and the target position cannot be generated for the time being.
zh_hans: 当前行情或策略计算尚未完成，暂时无法生成目标仓位。
zh_hant: 目前行情或策略計算尚未完成，暫時無法產生目標部位。

# 当前被动收入
source: Current Passive Income
zh_hans: 当前被动收入
zh_hant: 當前被動收入

# 当前记录缺少可投资资产；
source: The current record is missing investable assets;
zh_hans: 当前记录缺少可投资资产；
zh_hant: 目前記錄缺少可投資資產；

# 当前高夏普候选：叠加传染控制、美元现金、黄金恐慌锁盈，并在目标组合波动偏高且动量质量不足时稀疏降风险。
source: Current high Sharpe candidates: superimpose infection control, US dollar cash, gold panic lock-in profit, and sparse risk reduction when the target portfolio volatility is high and the momentum quality is insufficient.
zh_hans: 当前高夏普候选：叠加传染控制、美元现金、黄金恐慌锁盈，并在目标组合波动偏高且动量质量不足时稀疏降风险。
zh_hant: 目前高夏普候選：疊加傳染控制、美元現金、黃金恐慌鎖盈，並在目標組合波動偏高且動量品質不足時稀疏降風險。

# 恢复参数
source: Restore parameters
zh_hans: 恢复参数
zh_hant: 恢復參數

# 手动扫描 · 综合排序
source: On-Demand Scan · Composite Ranking
zh_hans: 手动扫描 · 综合排序
zh_hant: 手動掃描 · 綜合排序

# 打开资产时光机，更新最新策略信号。
source: Open Asset Time Machine to refresh the latest strategy signals.
zh_hans: 打开资产时光机，更新最新策略信号。
zh_hant: 開啟資產時光機，更新最新策略訊號。

# 打开资产时光机，查看最新策略信号。
source: Open Asset Time Machine to view the latest strategy signals.
zh_hans: 打开资产时光机，查看最新策略信号。
zh_hant: 開啟資產時光機，查看最新策略訊號。

# 打开资产时光机，选择一个策略作为每日提醒。
source: Open Asset Time Machine and select a strategy for daily alerts.
zh_hans: 打开资产时光机，选择一个策略作为每日提醒。
zh_hant: 開啟資產時光機，選擇一個策略作為每日提醒。

# 投入/本金
source: Investment/Principal
zh_hans: 投入/本金
zh_hant: 投入/本金

# 持有
source: Hold
zh_hans: 持有
zh_hant: 持有

# 持有中破位锁盈防守
source: Hold the mid-break position to lock in profit defense
zh_hans: 持有中破位锁盈防守
zh_hant: 持有中破位鎖盈防守

# 持有中破位锁盈防守建仓
source: In-Position Profit-Lock Defense Entry
zh_hans: 持有中破位锁盈防守建仓
zh_hant: 持有中破位鎖盈防守建倉

# 持续买
source: Keep buying
zh_hans: 持续买
zh_hant: 持續買

# 持续买入
source: Keep buying
zh_hans: 持续买入
zh_hant: 持續買入

# 指标
source: Indicator
zh_hans: 指标
zh_hant: 指標

# 按买入/卖出条件独立回测每个资产
source: Backtest each asset independently using its buy and sell rules
zh_hans: 按买入/卖出条件独立回测每个资产
zh_hant: 依買入/賣出條件獨立回測每個資產

# 按当前参数，需控制月开销在 %@ 以内。
source: Based on these assumptions, keep monthly spending below %1$@.
zh_hans: 按当前参数，需控制月开销在 %@ 以内。
zh_hant: 依目前參數，需控制月開銷在 %1$@ 以內。

# 按当前参数，需控制月开销在 %@ 以内，或收入涨到 %@/月。
source: Based on these assumptions, either keep monthly spending below %1$@ or increase monthly income to %2$@.
zh_hans: 按当前参数，需控制月开销在 %@ 以内，或收入涨到 %@/月。
zh_hant: 依目前參數，需控制月開銷在 %1$@ 以內，或收入漲到 %2$@/月。

# 按最新策略状态生成目标仓位。
source: Generate target positions according to the latest strategy status.
zh_hans: 按最新策略状态生成目标仓位。
zh_hant: 依最新策略狀態產生目標部位。

# 按最新记录%@估算；
source: Estimated according to the latest record %1$@;
zh_hans: 按最新记录%@估算；
zh_hant: 依最新記錄%1$@估算；

# 按每年最后一条快照，和上一年年末净资产对比
source: Compare the last snapshot of each year with the net assets at the end of the previous year
zh_hans: 按每年最后一条快照，和上一年年末净资产对比
zh_hant: 按每年最後一張快照，和前一年末淨資產對比

# 推荐候选：以近期亏损波动元策略为核心，核心仓位提升到97.5%；黄金趋势和相对强度同时有效时挂10%黄金卫星，兼顾收益和9%左右回撤控制。
source: Recommended candidate built on the Recent-Loss Volatility Meta-Strategy with 97.5% core exposure. Adds a 10% gold satellite when both gold trend and relative strength are positive, targeting stronger returns while keeping historical drawdown near 9%.
zh_hans: 推荐候选：以近期亏损波动元策略为核心，核心仓位提升到97.5%；黄金趋势和相对强度同时有效时挂10%黄金卫星，兼顾收益和9%左右回撤控制。
zh_hant: 推薦候選：以近期虧損波動元策略為核心，核心部位提升至97.5%；黃金趨勢和相對強度同時有效時掛10%黃金衛星，兼顧收益和9%左右回撤控制。

# 提醒时间
source: Reminder time
zh_hans: 提醒时间
zh_hant: 提醒時間

# 提醒策略
source: Notification Strategy
zh_hans: 提醒策略
zh_hant: 提醒策略

# 收入覆盖趋势
source: Income Coverage Trend
zh_hans: 收入覆盖趋势
zh_hant: 收入覆蓋趨勢

# 收益
source: Revenue
zh_hans: 收益
zh_hant: 收益

# 收益优先候选：黄金、纳指、标普、沪深300、上证综指中只拿最强资产；当A股泡沫式加速时不追满仓，主仓降到保护仓位并优先让黄金承接。
source: Priority candidates for income: only take the strongest assets among gold, Nasdaq, S&P, CSI 300, and Shanghai Composite Index; when the A-share bubble accelerates, instead of chasing full positions, the main position is reduced to a protective position and gold is given priority to take over.
zh_hans: 收益优先候选：黄金、纳指、标普、沪深300、上证综指中只拿最强资产；当A股泡沫式加速时不追满仓，主仓降到保护仓位并优先让黄金承接。
zh_hant: 收益優先候選：黃金、納指、標普、滬深300、上證綜指中只拿最強資產；當A股泡沫式加速時不追滿倉，主倉降到保護倉位並優先讓黃金承接。

# 收益优先候选：黄金作防守底仓，纳指/标普/A股指数只在90日回撤可控且动量或RSI重新转强时入场；每40个交易日再平衡，目标波动7.5%，最高仓位65%。
source: Priority candidate for income: gold serves as a defensive bottom position, and the Nasdaq/S&P/A-share index only enters the market when the 90-day drawdown is controllable and momentum or RSI becomes stronger again; rebalance every 40 trading days, with a target volatility of 7.5% and a maximum position of 65%.
zh_hans: 收益优先候选：黄金作防守底仓，纳指/标普/A股指数只在90日回撤可控且动量或RSI重新转强时入场；每40个交易日再平衡，目标波动7.5%，最高仓位65%。
zh_hant: 收益優先候選：黃金作防守底倉，納指/標普/A股指數只在90日回撤可控且動量或RSI重新轉強時入場；每40個交易日再平衡，目標波動7.5%，最高部位65%。

# 收益回撤候选：以权益曲线状态机为底层，把低风险档位压到73%，并在A股泡沫后破位时清掉对应A股袖套；目标是在10%左右年化下把最大回撤压进10%以内。
source: Return–Drawdown candidate built on an equity-curve state machine. Reduces the low-risk allocation to 73% and exits the relevant China-equity sleeve after a post-bubble breakdown, targeting roughly 10% annualized return with sub-10% maximum drawdown.
zh_hans: 收益回撤候选：以权益曲线状态机为底层，把低风险档位压到73%，并在A股泡沫后破位时清掉对应A股袖套；目标是在10%左右年化下把最大回撤压进10%以内。
zh_hant: 收益回撤候選：以權益曲線狀態機為底層，把低風險檔位壓到73%，並在A股泡沫後破位時清掉對應A股袖套；目標是在10%左右年化下把最大回撤壓進10%以內。

# 收益回撤门状态机
source: Yield Drawdown Gate State Machine
zh_hans: 收益回撤门状态机
zh_hant: 收益回撤門狀態機

# 收益回撤门状态机建仓
source: Return–Drawdown Gate Entry
zh_hans: 收益回撤门状态机建仓
zh_hant: 收益回撤門狀態機建倉

# 收起
source: Close
zh_hans: 收起
zh_hant: 收起

# 放大图表
source: Enlarge chart
zh_hans: 放大图表
zh_hant: 放大圖表

# 数据来源
source: Data Source
zh_hans: 数据来源
zh_hant: 資料來源

# 新冠军候选：近期亏损波动元策略保持满核心，黄金趋势和相对强度有效时挂10%黄金卫星；总仓位封顶85%，并用二月弱权益刹车和净值轻刹车控制回撤。
source: New champion candidate: The recent loss volatility meta strategy maintains full core, and the gold satellite is 10% when the gold trend and relative strength are effective; the total position is capped at 85%, and the February weak equity brake and net value light brake are used to control the drawdown.
zh_hans: 新冠军候选：近期亏损波动元策略保持满核心，黄金趋势和相对强度有效时挂10%黄金卫星；总仓位封顶85%，并用二月弱权益刹车和净值轻刹车控制回撤。
zh_hant: 新冠軍候選：近期虧損波動元策略保持滿核心，黃金趨勢和相對強度有效時掛10%黃金衛星；總倉位封頂85%，並用二月弱權益剎車和淨值輕剎車控制回撤。

# 新夏普冠军：以黄金交接保护为防守引擎、权益宽度为进攻引擎；当进攻引擎领先但自身波动高于防守引擎时，只降仓不加仓，剩余留现金。
source: New Sharpe Champion: Use gold handover protection as the defensive engine and equity width as the offensive engine; when the offensive engine is ahead but its own volatility is higher than the defensive engine, it will only reduce the position but not increase the position, and keep the remaining cash.
zh_hans: 新夏普冠军：以黄金交接保护为防守引擎、权益宽度为进攻引擎；当进攻引擎领先但自身波动高于防守引擎时，只降仓不加仓，剩余留现金。
zh_hant: 新夏普冠軍：以黃金交接保護為防守引擎、權益寬度為進攻引擎；當進攻引擎領先但自身波動高於防守引擎時，只降倉不加倉，剩餘留現金。

# 新搜索候选：黄金、标普、纳指中筛选180日动量为正且30日年化波动低于18%的资产；按低波动分散，每40个交易日再平衡，目标波动7.5%，最高仓位55%
source: New search candidates: Gold, S&P, and Nasdaq are screened for assets with positive 180-day momentum and 30-day annualized volatility less than 18%; disperse according to low volatility, rebalance every 40 trading days, with a target volatility of 7.5%, and a maximum position of 55%
zh_hans: 新搜索候选：黄金、标普、纳指中筛选180日动量为正且30日年化波动低于18%的资产；按低波动分散，每40个交易日再平衡，目标波动7.5%，最高仓位55%
zh_hant: 新搜尋候選：黃金、標普、納指中篩選180日動量為正且30日年化波動低於18%的資產；以低波動分散，每40個交易日再平衡，目標波動7.5%，最高部位55%

# 新逻辑候选：沿用热度上限元框架；当黄金短线转弱时先把黄金单仓压到45%，若美股趋势仍确认，则把释放的风险预算交接给更强的纳指或标普，否则留现金。
source: New logic candidate: Follow the heat limit element framework; when gold weakens in the short term, first reduce the gold single position to 45%. If the trend of the US stock market is still confirmed, transfer the released risk budget to the stronger Nasdaq or S&P, otherwise keep cash.
zh_hans: 新逻辑候选：沿用热度上限元框架；当黄金短线转弱时先把黄金单仓压到45%，若美股趋势仍确认，则把释放的风险预算交接给更强的纳指或标普，否则留现金。
zh_hant: 新邏輯候選：沿用熱度上限元框架；當黃金短線轉弱時先把黃金單倉壓到45%，若美股趨勢仍確認，則把釋放的風險預算交接給更強的納指或標普，否則留現金。

# 新高收益线：以动态袖套为核心，空闲预算只在回撤修复确认时承接恒生/日经等全球修复机会；A/H股泡沫回落和全球宽度转弱时临时压低权益仓。
source: Return-focused candidate built on the Dynamic Sleeve strategy. Idle risk budget is deployed into Hang Seng or Nikkei recovery opportunities only after drawdown recovery is confirmed; equity exposure is reduced when A/H-share excesses unwind or global breadth weakens.
zh_hans: 新高收益线：以动态袖套为核心，空闲预算只在回撤修复确认时承接恒生/日经等全球修复机会；A/H股泡沫回落和全球宽度转弱时临时压低权益仓。
zh_hant: 新高收益線：以動態袖套為核心，空閒預算只在回撤修復確認時承接恆生/日經等全球修復機會；A/H股泡沫回落和全球寬度轉弱時臨時壓低權益倉。

# 无日历三袖套复合
source: Three-sleeve composite without calendar
zh_hans: 无日历三袖套复合
zh_hant: 無日曆三袖套複合

# 无日历低回撤复合
source: No calendar low drawdown compounding
zh_hans: 无日历低回撤复合
zh_hant: 無日曆低迴檔複合

# 无日历高收益复合
source: Calendarless High Yield Compounding
zh_hans: 无日历高收益复合
zh_hant: 無日曆高收益複合

# 无法保存登录凭证
source: Unable to save login credentials
zh_hans: 无法保存登录凭证
zh_hant: 無法儲存登入憑證

# 日历桶风险预算复合
source: Calendar Bucket Risk Budget Compounding
zh_hans: 日历桶风险预算复合
zh_hant: 日曆桶風險預算複合

# 时光机加载中
source: Time machine loading
zh_hans: 时光机加载中
zh_hant: 時光機載入中

# 明细
source: Details
zh_hans: 明细
zh_hant: 明細

# 显示%@
source: Display %1$@
zh_hans: 显示%@
zh_hant: 顯示%1$@

# 智能优选策略
source: Strategy Optimizer
zh_hans: 智能优选策略
zh_hant: 智慧優選策略

# 暂不支持
source: Not Available
zh_hans: 暂不支持
zh_hant: 暫不支持

# 暂无%@记录
source: There is no record of %1$@ yet
zh_hans: 暂无%@记录
zh_hant: 暫無%1$@記錄

# 暂无云端备份，正在准备首次同步
source: No cloud backup yet, preparing for first synchronization
zh_hans: 暂无云端备份，正在准备首次同步
zh_hant: 暫無雲端備份，正準備首次同步

# 暂无成交
source: No transaction yet
zh_hans: 暂无成交
zh_hant: 暫無成交

# 暂无策略
source: No strategy yet
zh_hans: 暂无策略
zh_hant: 暫無策略

# 暂无资产记录；
source: There is no asset record;
zh_hans: 暂无资产记录；
zh_hant: 暫無資產記錄；

# 更多对照
source: More comparisons
zh_hans: 更多对照
zh_hant: 更多對照

# 更重视持有体验：黄金73%、标普1%、纳指26%，需站上MA220且120日动量为正；权益从180日高点回撤超过6%/12%时分级降仓，优先转向黄金或现金。
source: Designed for a smoother holding experience: 73% gold, 1% S&P 500, and 26% Nasdaq. Assets must be above their 220-day moving averages with positive 120-session momentum. Equity exposure is reduced in stages after 6% and 12% drawdowns from 180-session highs, with proceeds shifted to gold or cash.
zh_hans: 更重视持有体验：黄金73%、标普1%、纳指26%，需站上MA220且120日动量为正；权益从180日高点回撤超过6%/12%时分级降仓，优先转向黄金或现金。
zh_hant: 更重視持有體驗：黃金73%、標普1%、納指26%，需站上MA220且120日動量為正；權益從180日高點回撤超過6%/12%時分級降倉，優先轉向黃金或現金。

# 最低
source: Minimum
zh_hans: 最低
zh_hant: 最低

# 最大仓位
source: Max Exposure
zh_hans: 最大仓位
zh_hant: 最大部位

# 最好单月
source: Best single month
zh_hans: 最好单月
zh_hant: 最好單月

# 最好年份
source: Best Year
zh_hans: 最好年份
zh_hant: 最好年份

# 最新年利率
source: Latest annual interest rate
zh_hans: 最新年利率
zh_hant: 最新年利率

# 最近一年
source: Last year
zh_hans: 最近一年
zh_hant: 最近一年

# 最近交易
source: Recent Trades
zh_hans: 最近交易
zh_hant: 最近交易

# 最近回测
source: Recent Backtests
zh_hans: 最近回测
zh_hant: 最近回測

# 最高
source: Highest
zh_hans: 最高
zh_hant: 最高

# 月份
source: Month
zh_hans: 月份
zh_hant: 月份

# 月均结余
source: Average monthly balance
zh_hans: 月均结余
zh_hant: 月均結餘

# 月度候选：沿用热度上限元策略框架，但约每30个交易日检查一次；单权益上限提高到72%，保留黄金卫星、二月弱势刹车和净值轻刹车，追求更平滑的全周期回撤。
source: Monthly Candidate: Follow the popularity cap meta-strategy framework, but check it approximately every 30 trading days; increase the single equity cap to 72%, retain the gold satellite, February weak braking and net value light braking, and pursue a smoother full-cycle drawdown.
zh_hans: 月度候选：沿用热度上限元策略框架，但约每30个交易日检查一次；单权益上限提高到72%，保留黄金卫星、二月弱势刹车和净值轻刹车，追求更平滑的全周期回撤。
zh_hant: 每月候選：沿用熱度上限元策略框架，但約每30個交易日檢查一次；單權益上限提高到72%，保留黃金衛星、二月弱勢剎車和淨值輕剎車，追求更平滑的全週期回撤。

# 月度热度上限元
source: Monthly Heat-Cap Meta-Strategy
zh_hans: 月度热度上限元
zh_hant: 月熱度上限元

# 月度热度上限元建仓
source: Monthly Heat-Cap Meta-Strategy Entry
zh_hans: 月度热度上限元建仓
zh_hant: 月度熱度上限元建倉

# 月结余
source: Monthly
zh_hans: 月结余
zh_hant: 月結餘

# 月薪
source: Monthly Income
zh_hans: 月薪
zh_hant: 月薪

# 期末资产
source: Ending Portfolio Value
zh_hans: 期末资产
zh_hant: 期末資產

# 未投入部分保留为防守仓位
source: The uninvested portion is reserved as a defensive position
zh_hans: 未投入部分保留为防守仓位
zh_hant: 未投入部分保留為防守部位

# 未来 %d 年
source: Future %1$d years
zh_hans: 未来 %d 年
zh_hant: 未來 %1$d 年

# 未知大小
source: Unknown size
zh_hans: 未知大小
zh_hant: 未知大小

# 未获得相册保存权限
source: Not granted permission to save photo album
zh_hans: 未获得相册保存权限
zh_hant: 未取得相簿保存權限

# 未记录
source: Not logged
zh_hans: 未记录
zh_hant: 未記錄

# 未选择
source: Not selected
zh_hans: 未选择
zh_hant: 未選擇

# 未配置资产
source: No assets allocated
zh_hans: 未配置资产
zh_hant: 未配置資產

# 权益宽度进攻引擎
source: Equity breadth attack engine
zh_hans: 权益宽度进攻引擎
zh_hant: 權益寬度進攻引擎

# 权益宽度进攻引擎建仓
source: Equity-Breadth Growth Engine Entry
zh_hans: 权益宽度进攻引擎建仓
zh_hant: 權益寬度進攻引擎建倉

# 条件删除
source: Conditional deletion
zh_hans: 条件删除
zh_hant: 條件刪除

# 极稳轮动
source: Extremely stable rotation
zh_hans: 极稳轮动
zh_hant: 極穩輪動

# 极稳轮动建仓
source: Ultra-Stable Rotation Entry
zh_hans: 极稳轮动建仓
zh_hant: 極穩輪動建倉

# 查看当日记录
source: View the record of the day
zh_hans: 查看当日记录
zh_hant: 查看當日記錄

# 查看更多（共%d笔）
source: View All (%1$d Trades)
zh_hans: 查看更多（共%d笔）
zh_hant: 看更多（共%1$d筆）

# 查看财富自由算法说明
source: How Financial Independence Is Calculated
zh_hans: 查看财富自由算法说明
zh_hant: 查看財富自由演算法說明

# 标普500/纳指历史价格 · 仅作风控信号
source: S&P 500/Nasdaq historical prices · For risk control signals only
zh_hans: 标普500/纳指历史价格 · 仅作风控信号
zh_hant: 標普500/納指歷史價格 · 僅作風控訊號

# 核心动量+黄金卫星保守建仓
source: Core Momentum + Gold Satellite — Conservative Entry
zh_hans: 核心动量+黄金卫星保守建仓
zh_hant: 核心動量+黃金衛星保守建倉

# 核心动量+黄金卫星平衡建仓
source: Core Momentum + Gold Satellite — Balanced Entry
zh_hans: 核心动量+黄金卫星平衡建仓
zh_hant: 核心動量+黃金衛星平衡建倉

# 核心动量+黄金卫星满核心建仓
source: Core Momentum + Gold Satellite — Full-Core Entry
zh_hans: 核心动量+黄金卫星满核心建仓
zh_hant: 核心動量+黃金衛星滿核心建倉

# 核心动量+黄金卫星进攻建仓
source: Core Momentum + Gold Satellite — Aggressive Entry
zh_hans: 核心动量+黄金卫星进攻建仓
zh_hant: 核心動量+黃金衛星攻擊建倉

# 核心动量+黄金卫星（保守）
source: Core Momentum + Gold Satellite (Conservative)
zh_hans: 核心动量+黄金卫星（保守）
zh_hant: 核心動量+黃金衛星（保守）

# 核心动量+黄金卫星（平衡）
source: Core Momentum + Gold Satellite (Balanced)
zh_hans: 核心动量+黄金卫星（平衡）
zh_hant: 核心動量+黃金衛星（平衡）

# 核心动量+黄金卫星（满核心）
source: Core Momentum + Gold Satellite — Full Core
zh_hans: 核心动量+黄金卫星（满核心）
zh_hant: 核心動量+黃金衛星（滿核心）

# 核心动量+黄金卫星（进攻）
source: Core Momentum + Gold Satellite — Aggressive
zh_hans: 核心动量+黄金卫星（进攻）
zh_hant: 核心動量+黃金衛星（攻擊）

# 核心黄金趋势卫星
source: Core Gold Trend Satellite
zh_hans: 核心黄金趋势卫星
zh_hant: 核心黃金趨勢衛星

# 核心黄金趋势卫星建仓
source: Core Gold Trend Satellite Entry
zh_hans: 核心黄金趋势卫星建仓
zh_hant: 核心黃金趨勢衛星建倉

# 根据最新行情和资产记录生成调仓提醒。
source: Generate rebalance alerts from the latest market data and portfolio records.
zh_hans: 根据最新行情和资产记录生成调仓提醒。
zh_hant: 根據最新行情和資產記錄產生調倉提醒。

# 止损线
source: Stop Loss
zh_hans: 止损线
zh_hant: 停損線

# 止损触发
source: Stop-Loss Triggered
zh_hans: 止损触发
zh_hant: 停損觸發

# 止盈线
source: Take Profit
zh_hans: 止盈线
zh_hant: 止盈線

# 止盈触发
source: Take-Profit Triggered
zh_hans: 止盈触发
zh_hant: 止盈觸發

# 正在上传或恢复你的资产数据
source: Uploading or restoring your asset data
zh_hans: 正在上传或恢复你的资产数据
zh_hant: 正在上傳或恢復你的資產數據

# 正在保存
source: Saving
zh_hans: 正在保存
zh_hant: 正在保存

# 正在加载历史数据…
source: Loading historical data...
zh_hans: 正在加载历史数据…
zh_hant: 正在載入歷史資料…
